# Exercise 1: From the given dataset print the first and last five rows

In [16]:
import pandas as pd

pd.set_option('display.width', 1500) # or a larger number depending on your screen
pd.set_option('display.max_columns', None) # 'None' means show all columns

In [18]:
df = pd.read_csv("Automobile_data.csv")
print(df.head())
print(df.tail())

   index      company   body-style  wheel-base  length engine-type num-of-cylinders  horsepower  average-mileage    price
0      0  alfa-romero  convertible        88.6   168.8        dohc             four         111               21  13495.0
1      1  alfa-romero  convertible        88.6   168.8        dohc             four         111               21  16500.0
2      2  alfa-romero    hatchback        94.5   171.2        ohcv              six         154               19  16500.0
3      3         audi        sedan        99.8   176.6         ohc             four         102               24  13950.0
4      4         audi        sedan        99.4   176.6         ohc             five         115               18  17450.0
    index     company body-style  wheel-base  length engine-type num-of-cylinders  horsepower  average-mileage    price
56     81  volkswagen      sedan        97.3   171.7         ohc             four          85               27   7975.0
57     82  volkswagen      sedan        97.3   171.7         ohc             four          52               37   7995.0
58     86  volkswagen      sedan        97.3   171.7         ohc             four         100               26   9995.0
59     87       volvo      sedan       104.3   188.8         ohc             four         114               23  12940.0
60     88       volvo      wagon       104.3   188.8         ohc             four         114               23  13415.0


# Exercise 2: Clean the dataset and update the CSV file

Replace all column values which contain ?, n.a, or NaN.

In [37]:
df = pd.read_csv("Automobile_data.csv", na_values={
    "price" : ["?", "n.c"]
})
df.to_csv("Automobile_data.csv")
print(df.iloc[20:30, :])

    index company body-style  wheel-base  length engine-type num-of-cylinders  horsepower  average-mileage    price
20     29   honda      sedan        96.5   169.1         ohc             four         100               25  10345.0
21     30   isuzu      sedan        94.3   170.7         ohc             four          78               24   6785.0
22     31   isuzu      sedan        94.5   155.9         ohc             four          70               38      NaN
23     32   isuzu      sedan        94.5   155.9         ohc             four          70               38      NaN
24     33  jaguar      sedan       113.0   199.6        dohc              six         176               15  32250.0
25     34  jaguar      sedan       113.0   199.6        dohc              six         176               15  35550.0
26     35  jaguar      sedan       102.0   191.7        ohcv           twelve         262               13  36000.0
27     36   mazda  hatchback        93.1   159.1         ohc             four          68               30   5195.0
28     37   mazda  hatchback        93.1   159.1         ohc             four          68               31   6095.0
29     38   mazda  hatchback        93.1   159.1         ohc             four          68               31   6795.0


# Exercise 3: Find the most expensive car company name

Print most expensive car’s company name and price.

In [35]:
df = df[["company", "price"]][df.price == df['price'].max()] 
df

          company    price
35  mercedes-benz  45400.0


# Exercise 4: Print All Toyota Cars details

In [41]:
df = pd.read_csv("Automobile_data.csv")
df = df[df.company == 'toyota']
df

    Unnamed: 0  index company body-style  wheel-base  length engine-type num-of-cylinders  horsepower  average-mileage    price
48          48     66  toyota  hatchback        95.7   158.7         ohc             four          62               35   5348.0
49          49     67  toyota  hatchback        95.7   158.7         ohc             four          62               31   6338.0
50          50     68  toyota  hatchback        95.7   158.7         ohc             four          62               31   6488.0
51          51     69  toyota      wagon        95.7   169.7         ohc             four          62               31   6918.0
52          52     70  toyota      wagon        95.7   169.7         ohc             four          62               27   7898.0
53          53     71  toyota      wagon        95.7   169.7         ohc             four          62               27   8778.0
54          54     79  toyota      wagon       104.5   187.8        dohc              six         156               19  15750.0


# Exercise 5: Count total cars per company

In [44]:
df = pd.read_csv("Automobile_data.csv")
df['company'].value_counts()

company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: count, dtype: int64


# Exercise 6: Find each company’s Higesht price car

In [47]:
car

          company    price
35  mercedes-benz  45400.0